Tekla Open API Reference for Tekla Structures 2025
RebarLegSurfaceObject.LayerNumber Property
 Gets or sets the layer number of the leg surface object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int LayerNumber { get; set; }
Public Property LayerNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RebarLegSurfaceObject Class
Tekla.Structures.Model Namespace